Realizando os Imports necessários

In [1]:
import pandas as pd
import basedosdados as bd

Configurando o Google Cloud

In [2]:
project_id = "sinuous-gist-433018-f3"

## Verificando tamanho dos datasets escolhidos e outras informações sobre o dataset

INEP IDEB - Tabela Brasil

In [8]:
query_1 = """
SELECT COUNT(*) AS linhas
FROM `basedosdados.br_inep_ideb.brasil`
"""
que1 = bd.read_sql(query_1, billing_project_id=project_id)
que1.head()

Downloading: 100%|██████████|

   linhas
0     140

In [10]:
query_2 = """
SELECT * 
FROM `basedosdados.br_inep_ideb.brasil`
"""
df_ideb_brasil = bd.read_sql(query_2, billing_project_id=project_id)
df_ideb_brasil.head()

Downloading: 100%|██████████|

,ano,rede,ensino,anos_escolares,taxa_aprovacao,indicador_rendimento,nota_saeb_matematica,nota_saeb_lingua_portuguesa,nota_saeb_media_padronizada,ideb,projecao
0,2005,privada,medio,todos (1-4),92.7,0.933066,333.30,306.88,5.964842,5.6,NaN
1,2005,estadual,medio,todos (1-4),70.5,0.747708,260.02,248.69,4.064599,3.0,NaN
2,2005,total,medio,todos (1-4),73.2,0.771854,271.29,257.60,4.356054,3.4,NaN
3,2005,publica,medio,todos (1-4),70.6,0.750616,260.80,249.27,4.084188,3.1,NaN
4,2005,total,fundamental,finais (6-9),77.0,0.772003,239.52,231.82,4.522333,3.5,NaN

In [34]:
df_ideb_brasil.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140 entries, 0 to 139
Data columns (total 11 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ano                          140 non-null    Int64
 1   rede                         140 non-null    object
 2   ensino                       140 non-null    object
 3   anos_escolares               140 non-null    object
 4   taxa_aprovacao               140 non-null    float64
 5   indicador_rendimento         140 non-null    float64
 6   nota_saeb_matematica         140 non-null    float64
 7   nota_saeb_lingua_portuguesa  140 non-null    float64
 8   nota_saeb_media_padronizada  140 non-null    float64
 9   ideb                         140 non-null    float64
 10  projecao                     98 non-null     float64
dtypes: Int64(1), float64(7), object(3)
memory usage: 12.3+ KB

Essa tabela traz algumas informações interessantes sobre o desenvolvimento escolar, seperado por ano.

IDEB - Região

In [11]:
query_3 = """
SELECT COUNT(*) AS linhas
FROM `basedosdados.br_inep_ideb.regiao`
"""
que2 = bd.read_sql(query_3, billing_project_id=project_id)
que2.head()

Downloading: 100%|██████████|

   linhas
0     550

In [12]:
query_3 = """
SELECT *
FROM `basedosdados.br_inep_ideb.regiao`
"""
df_ideb_regiao = bd.read_sql(query_3, billing_project_id=project_id)
df_ideb_regiao.head()

Downloading: 100%|██████████|

,ano,regiao,rede,ensino,anos_escolares,taxa_aprovacao,indicador_rendimento,nota_saeb_matematica,nota_saeb_lingua_portuguesa,nota_saeb_media_padronizada,ideb,projecao
0,2005,Nordeste,total,medio,todos (1-4),70.9,0.754940,258.16,246.22,4.001304,3.0,NaN
1,2013,Nordeste,estadual,medio,todos (1-4),77.5,0.803350,246.19,241.55,3.763397,3.0,3.3
2,2011,Nordeste,estadual,medio,todos (1-4),74.2,0.778385,248.80,248.11,3.898408,3.0,3.0
3,2007,Centro-Oeste,estadual,medio,todos (1-4),69.9,0.728263,262.72,252.77,4.163534,3.0,2.9
4,2009,Sudeste,estadual,medio,todos (1-4),75.3,0.789505,270.70,266.26,4.477549,3.5,3.3

In [35]:
df_ideb_regiao.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550 entries, 0 to 549
Data columns (total 12 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ano                          550 non-null    Int64
 1   regiao                       550 non-null    object
 2   rede                         550 non-null    object
 3   ensino                       550 non-null    object
 4   anos_escolares               550 non-null    object
 5   taxa_aprovacao               550 non-null    float64
 6   indicador_rendimento         550 non-null    float64
 7   nota_saeb_matematica         550 non-null    float64
 8   nota_saeb_lingua_portuguesa  550 non-null    float64
 9   nota_saeb_media_padronizada  550 non-null    float64
 10  ideb                         550 non-null    float64
 11  projecao                     385 non-null    float64
dtypes: Int64(1), float64(7), object(4)
memory usage: 52.2+ KB

IDEB - Municipio

In [14]:
query_4 = """
SELECT COUNT(*) AS linhas
FROM `basedosdados.br_inep_ideb.municipio`
"""
que3 = bd.read_sql(query_4, billing_project_id=project_id)
que3.head()

Downloading: 100%|██████████|

   linhas
0  323991

In [16]:
query_5 = """
SELECT *
FROM `basedosdados.br_inep_ideb.municipio`
WHERE indicador_rendimento IS NOT NULL AND taxa_aprovacao IS NOT NULL
"""
df_ideb_municipio = bd.read_sql(query_5, billing_project_id=project_id)
df_ideb_municipio.head()

Downloading:   0%|          |
Downloading:  27%|██▋       |
Downloading:  27%|██▋       |
Downloading:  53%|█████▎    |
Downloading:  79%|███████▉  |
Downloading:  79%|███████▉  |
Downloading: 100%|██████████|

,ano,sigla_uf,id_municipio,rede,ensino,anos_escolares,taxa_aprovacao,indicador_rendimento,nota_saeb_matematica,nota_saeb_lingua_portuguesa,nota_saeb_media_padronizada,ideb,projecao
0,2009,MG,3155108,municipal,fundamental,finais (6-9),83.1,0.828705,NaN,NaN,NaN,NaN,3.2
1,2009,GO,5219803,municipal,fundamental,finais (6-9),72.4,0.742764,NaN,NaN,NaN,NaN,2.8
2,2009,RS,4302154,estadual,fundamental,finais (6-9),83.2,0.844211,NaN,NaN,NaN,NaN,4.5
3,2009,AL,2706000,estadual,fundamental,finais (6-9),84.9,0.852070,NaN,NaN,NaN,NaN,3.1
4,2009,TO,1716604,municipal,fundamental,finais (6-9),75.7,0.762417,NaN,NaN,NaN,NaN,2.9

In [36]:
df_ideb_municipio.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 291984 entries, 0 to 291983
Data columns (total 13 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   ano                          291984 non-null  Int64
 1   sigla_uf                     291984 non-null  object
 2   id_municipio                 291984 non-null  object
 3   rede                         291984 non-null  object
 4   ensino                       291984 non-null  object
 5   anos_escolares               291984 non-null  object
 6   taxa_aprovacao               291984 non-null  float64
 7   indicador_rendimento         291984 non-null  float64
 8   nota_saeb_matematica         274453 non-null  float64
 9   nota_saeb_lingua_portuguesa  274453 non-null  float64
 10  nota_saeb_media_padronizada  274453 non-null  float64
 11  ideb                         274453 non-null  float64
 12  projecao                     179132 non-null  float64
dtypes: Int64(1), float64(7), object(5)
memory usage: 29.2+ MB

## Base de dados do Enem

Trazendos os dados do questionário socioeconômico 2022

In [ ]:
query_6 = """
WITH 
dicionario_Q001 AS (
    SELECT
        chave AS chave_Q001,
        valor AS descricao_Q001
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q001'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q002 AS (
    SELECT
        chave AS chave_Q002,
        valor AS descricao_Q002
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q002'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q003 AS (
    SELECT
        chave AS chave_Q003,
        valor AS descricao_Q003
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q003'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q004 AS (
    SELECT
        chave AS chave_Q004,
        valor AS descricao_Q004
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q004'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q005 AS (
    SELECT
        chave AS chave_Q005,
        valor AS descricao_Q005
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q005'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q006 AS (
    SELECT
        chave AS chave_Q006,
        valor AS descricao_Q006
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q006'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q007 AS (
    SELECT
        chave AS chave_Q007,
        valor AS descricao_Q007
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q007'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q008 AS (
    SELECT
        chave AS chave_Q008,
        valor AS descricao_Q008
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q008'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q009 AS (
    SELECT
        chave AS chave_Q009,
        valor AS descricao_Q009
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q009'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q010 AS (
    SELECT
        chave AS chave_Q010,
        valor AS descricao_Q010
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q010'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q011 AS (
    SELECT
        chave AS chave_Q011,
        valor AS descricao_Q011
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q011'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q012 AS (
    SELECT
        chave AS chave_Q012,
        valor AS descricao_Q012
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q012'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q013 AS (
    SELECT
        chave AS chave_Q013,
        valor AS descricao_Q013
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q013'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q014 AS (
    SELECT
        chave AS chave_Q014,
        valor AS descricao_Q014
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q014'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q015 AS (
    SELECT
        chave AS chave_Q015,
        valor AS descricao_Q015
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q015'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q016 AS (
    SELECT
        chave AS chave_Q016,
        valor AS descricao_Q016
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q016'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q017 AS (
    SELECT
        chave AS chave_Q017,
        valor AS descricao_Q017
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q017'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q018 AS (
    SELECT
        chave AS chave_Q018,
        valor AS descricao_Q018
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q018'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q019 AS (
    SELECT
        chave AS chave_Q019,
        valor AS descricao_Q019
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q019'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q020 AS (
    SELECT
        chave AS chave_Q020,
        valor AS descricao_Q020
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q020'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q021 AS (
    SELECT
        chave AS chave_Q021,
        valor AS descricao_Q021
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q021'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q022 AS (
    SELECT
        chave AS chave_Q022,
        valor AS descricao_Q022
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q022'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q023 AS (
    SELECT
        chave AS chave_Q023,
        valor AS descricao_Q023
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q023'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q024 AS (
    SELECT
        chave AS chave_Q024,
        valor AS descricao_Q024
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q024'
        AND id_tabela = 'questionario_socioeconomico_2022'
),
dicionario_Q025 AS (
    SELECT
        chave AS chave_Q025,
        valor AS descricao_Q025
    FROM `basedosdados.br_inep_enem.dicionario`
    WHERE
        TRUE
        AND nome_coluna = 'Q025'
        AND id_tabela = 'questionario_socioeconomico_2022'
)
SELECT
    dados.id_inscricao as id_inscricao,
    descricao_Q001 AS Q001,
    descricao_Q002 AS Q002,
    descricao_Q003 AS Q003,
    descricao_Q004 AS Q004,
    descricao_Q005 AS Q005,
    descricao_Q006 AS Q006,
    descricao_Q007 AS Q007,
    descricao_Q008 AS Q008,
    descricao_Q009 AS Q009,
    descricao_Q010 AS Q010,
    descricao_Q011 AS Q011,
    descricao_Q012 AS Q012,
    descricao_Q013 AS Q013,
    descricao_Q014 AS Q014,
    descricao_Q015 AS Q015,
    descricao_Q016 AS Q016,
    descricao_Q017 AS Q017,
    descricao_Q018 AS Q018,
    descricao_Q019 AS Q019,
    descricao_Q020 AS Q020,
    descricao_Q021 AS Q021,
    descricao_Q022 AS Q022,
    descricao_Q023 AS Q023,
    descricao_Q024 AS Q024,
    descricao_Q025 AS Q025
FROM `basedosdados.br_inep_enem.questionario_socioeconomico_2022` AS dados
LEFT JOIN `dicionario_Q001`
    ON dados.Q001 = chave_Q001
LEFT JOIN `dicionario_Q002`
    ON dados.Q002 = chave_Q002
LEFT JOIN `dicionario_Q003`
    ON dados.Q003 = chave_Q003
LEFT JOIN `dicionario_Q004`
    ON dados.Q004 = chave_Q004
LEFT JOIN `dicionario_Q005`
    ON dados.Q005 = chave_Q005
LEFT JOIN `dicionario_Q006`
    ON dados.Q006 = chave_Q006
LEFT JOIN `dicionario_Q007`
    ON dados.Q007 = chave_Q007
LEFT JOIN `dicionario_Q008`
    ON dados.Q008 = chave_Q008
LEFT JOIN `dicionario_Q009`
    ON dados.Q009 = chave_Q009
LEFT JOIN `dicionario_Q010`
    ON dados.Q010 = chave_Q010
LEFT JOIN `dicionario_Q011`
    ON dados.Q011 = chave_Q011
LEFT JOIN `dicionario_Q012`
    ON dados.Q012 = chave_Q012
LEFT JOIN `dicionario_Q013`
    ON dados.Q013 = chave_Q013
LEFT JOIN `dicionario_Q014`
    ON dados.Q014 = chave_Q014
LEFT JOIN `dicionario_Q015`
    ON dados.Q015 = chave_Q015
LEFT JOIN `dicionario_Q016`
    ON dados.Q016 = chave_Q016
LEFT JOIN `dicionario_Q017`
    ON dados.Q017 = chave_Q017
LEFT JOIN `dicionario_Q018`
    ON dados.Q018 = chave_Q018
LEFT JOIN `dicionario_Q019`
    ON dados.Q019 = chave_Q019
LEFT JOIN `dicionario_Q020`
    ON dados.Q020 = chave_Q020
LEFT JOIN `dicionario_Q021`
    ON dados.Q021 = chave_Q021
LEFT JOIN `dicionario_Q022`
    ON dados.Q022 = chave_Q022
LEFT JOIN `dicionario_Q023`
    ON dados.Q023 = chave_Q023
LEFT JOIN `dicionario_Q024`
    ON dados.Q024 = chave_Q024
LEFT JOIN `dicionario_Q025`
    ON dados.Q025 = chave_Q025
LIMIT 1000000
"""
df_enem_2022_socioeconomico = bd.read_sql(query_6, billing_project_id=project_id)

In [24]:
df_enem_2022_socioeconomico.head()

,id_inscricao,Q001,Q002,Q003,Q004,Q005,Q006,Q007,Q008,Q009,...,Q016,Q017,Q018,Q019,Q020,Q021,Q022,Q023,Q024,Q025
0,210055803183,Nunca estudou.,Não completou a 4ª série/5º ano do Ensino Fund...,"Grupo 2: Diarista, empregado doméstico, cuidad...","Grupo 1: Lavradora, agricultora sem empregados...",5,Nenhuma Renda,Não.,"Sim, um.","Sim, dois.",...,Não.,"Sim, uma.",Não.,"Sim, uma.",Não.,Não.,"Sim, um.",Não.,Não.,Sim.
1,210054483116,Nunca estudou.,"Completou a 4ª série/5º ano, mas não completou...","Grupo 1: Lavrador, agricultor sem empregados, ...","Grupo 1: Lavradora, agricultora sem empregados...",9,Nenhuma Renda,Não.,"Sim, um.","Sim, um.",...,Não.,Não.,Não.,"Sim, uma.",Não.,Não.,"Sim, três.",Não.,Não.,Não.
2,210058017360,Nunca estudou.,Nunca estudou.,"Grupo 1: Lavrador, agricultor sem empregados, ...","Grupo 1: Lavradora, agricultora sem empregados...","1, pois moro sozinho(a).",Nenhuma Renda,Não.,"Sim, um.","Sim, um.",...,Não.,Não.,Não.,"Sim, uma.",Não.,Não.,"Sim, um.",Não.,Não.,Sim.
3,210054795984,Nunca estudou.,Nunca estudou.,"Grupo 1: Lavrador, agricultor sem empregados, ...","Grupo 1: Lavradora, agricultora sem empregados...",2,Nenhuma Renda,Não.,"Sim, um.","Sim, dois.",...,Não.,Não.,Não.,"Sim, uma.",Sim.,Não.,"Sim, dois.",Não.,Não.,Sim.
4,210055414429,Nunca estudou.,Não completou a 4ª série/5º ano do Ensino Fund...,"Grupo 1: Lavrador, agricultor sem empregados, ...","Grupo 1: Lavradora, agricultora sem empregados...",3,Nenhuma Renda,Não.,"Sim, um.","Sim, dois.",...,Não.,Não.,Não.,"Sim, uma.",Não.,Não.,"Sim, um.",Não.,Não.,Sim.

Agora vou trazer os microdados da prova enem 2022

In [21]:
query_7 = """
SELECT ano, id_inscricao, id_municipio_residencia, cor_raca, tipo_escola, ensino, id_municipio_escola, localizacao_escola, nota_objetiva, nota_redacao
FROM `basedosdados.br_inep_enem.microdados` 
WHERE ano = 2022
LIMIT 1000000
"""
df_enem_2022 = bd.read_sql(query_7, billing_project_id=project_id)

Downloading: 100%|██████████|

Verificando se temos valores nulos

In [22]:
df_enem_2022.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 10 columns):
 #   Column                   Non-Null Count    Dtype
---  ------                   --------------    -----
 0   ano                      1000000 non-null  Int64
 1   id_inscricao             1000000 non-null  object
 2   id_municipio_residencia  0 non-null        object
 3   cor_raca                 1000000 non-null  object
 4   tipo_escola              1000000 non-null  object
 5   ensino                   355056 non-null   object
 6   id_municipio_escola      267612 non-null   object
 7   localizacao_escola       267612 non-null   object
 8   nota_objetiva            0 non-null        float64
 9   nota_redacao             707897 non-null   float64
dtypes: Int64(1), float64(2), object(7)
memory usage: 77.2+ MB

Um dado que eu queria era o id_municipio e infelizmente não temos nenhum. Então irei utilizar como base id_municipio_escola.

Verificando as informações do dataframe df_enem_2022_socioeconomico

In [23]:
df_enem_2022_socioeconomico.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 26 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   id_inscricao  1000000 non-null  object
 1   Q001          1000000 non-null  object
 2   Q002          1000000 non-null  object
 3   Q003          1000000 non-null  object
 4   Q004          1000000 non-null  object
 5   Q005          1000000 non-null  object
 6   Q006          1000000 non-null  object
 7   Q007          1000000 non-null  object
 8   Q008          1000000 non-null  object
 9   Q009          1000000 non-null  object
 10  Q010          1000000 non-null  object
 11  Q011          1000000 non-null  object
 12  Q012          1000000 non-null  object
 13  Q013          1000000 non-null  object
 14  Q014          1000000 non-null  object
 15  Q015          1000000 non-null  object
 16  Q016          1000000 non-null  object
 17  Q017          1000000 non-null  object
 18  Q018          1000000 non-null  object
 19  Q019          1000000 non-null  object
 20  Q020          1000000 non-null  object
 21  Q021          1000000 non-null  object
 22  Q022          1000000 non-null  object
 23  Q023          1000000 non-null  object
 24  Q024          1000000 non-null  object
 25  Q025          1000000 non-null  object
dtypes: object(26)
memory usage: 198.4+ MB

Verificando quais ID's tenho em comum nos dois DF

In [31]:
df_match_id = pd.merge(df_enem_2022[['id_inscricao','id_municipio_escola']],df_enem_2022_socioeconomico['id_inscricao'], on='id_inscricao', how='inner')
df_match_id_filter = df_match_id[df_match_id['id_municipio_escola'].notna()][['id_inscricao']]

In [33]:
df_match_id_filter.info()

<class 'pandas.core.frame.DataFrame'>
Index: 63978 entries, 19000 to 291642
Data columns (total 1 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id_inscricao  63978 non-null  object
dtypes: object(1)
memory usage: 999.7+ KB

Aqui eu filtrei os id's inscrição válidos, que existiam nos dois DF, porque eu não puxei a tabela toda e fiz um filtro para pegar somente os id's que tinham id_inscricao_municipio NOT NULL. Dessa forma, vamos ter uma amostra de 63798 casos para analisar, em relação ao ensino superior.